// iterator.sample.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>
#include <vector>

int main()
{
    std::vector<int> v = {10, 20, 30};

    auto itr = v.begin();                               // 先頭要素を示すイテレータ
    ++itr;                                              // 次の要素に移動
    --itr;                                              // 前の要素に移動
    itr += 3;                                           // 3つ後ろの要素に移動
    for (auto it = v.begin(); it != v.end(); ++it)      // イテレータを用いて全要素をループ
        std::cout << *it << std::endl;                  // イテレータが指す要素を参照
}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
